/*
УМОВА
Запросити від користувача число в діапазоні 0-9. 
Отримане значення перевірити в масиві і отримати відповідну букву. 
Вивести результат в консоль для користувача. Якщо число за межами діапазону, 
вивести попередження.

Потрібно ще запросити в користувача на початку кількість букв у слові. 
І потім просити у нього потрібну кількість разів числа для букв.

НАПРИКЛАД
Введіть кількість букв у слові.
4
введіть 1 число: 0
введіть 2 число: 1
введіть 3 число: 7
введіть 4 число: 2
Результат: диня
*/


let num = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];
let abc = ['д', 'и', 'я', 'о', 'ш', 'б', 'л', 'н', 'а', 'с'];
let numWord;
let n;
let word = '';
let contExit = '';

while (true) {
    numWord = Number(prompt('Скільки цифр хочете ввести (від 0 до 9)?'));

    if (numWord >= 0 && numWord <= 9) {
        console.log('Ваше число:', numWord);
    } else {
        alert('Невірно введені дані. Спробуйте ще раз.');
        console.log('Невірно введені дані. Спробуйте ще раз.');
    }
        
    for (let i = 0; i < numWord; i++) {
        let ch = (i + 1);
        let n = Number(prompt('Введіть ' + ch + ' число (від 0 до 9):')); // Ввели число
        
        if (n >= 0 && n <= 9) {
            console.log(ch + ' число:', n);
            word += abc[n];
        } else {
            alert('Невірно введені дані.');
            console.log('Невірно введені дані.');
            break;
        }

        if (ch === numWord) {
            console.log('Слово:' + word);
            alert('Слово: ' + word);
            word = '';
        }
    }

    contExit = prompt('Спробувати ще раз? Так або ні?').toLowerCase();
    console.log('Спробувати ще раз?');

    if (contExit === 'так') {
        console.log('Обрано:', contExit);
        continue;
    } else if (contExit === 'ні') {
        console.log('Обрано:', contExit);
        alert('До зустрічі!');
        break;
    } else {
        break;
    }
}

